brianwyld/ble_nrf52_v2/src/main.c
/**@brief Function for handling database discovery events.
 *
 * @details This function is callback function to handle events from the database discovery module.
 *          Depending on the UUIDs that are discovered, this function should forward the events
 *          to their respective services.
 *
 * @param[in] p_event  Pointer to the database discovery event.
 */
static void db_discovery_handler(ble_db_discovery_evt_t * p_evt)
{
    log_info("discover event %d", p_evt->evt_type);
    comm_ble_discovery_dispatch(p_evt);
//    comm_ble_disconnect_client(); TODO Not sure where the disconnect for the BLE NUS GATT service should be
}


/**@brief Function for handling events from the BSP module.
 *
 * @param[in] event  Event generated by bsp
 */
/*
static void bsp_event_handler(bsp_event_t event)
{
    switch (event)
    {
        case BSP_EVENT_SLEEP:
            sleep_mode_enter();
        break;

        case BSP_EVENT_DISCONNECT:
            comm_ble_disconnect();
            advertising_check_start();
        break;
        case BSP_EVENT_WHITELIST_OFF:
            advertising_check_start();
        break;
            
        default:
        break;
    }
}
*/

// Callback when system events happen
static void sys_evt_handler(uint32_t evt)
{
    switch(evt)
    {
        case NRF_EVT_FLASH_OPERATION_SUCCESS:
            _ctx.flashBusy = false;
        break;
        
        case NRF_EVT_FLASH_OPERATION_ERROR:
            _ctx.flashBusy = false;         // Still finished though
        break;
        
        default:
        break;
    }
}

/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
/*
static void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;
 
    uint32_t err_code = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS,
                                 APP_TIMER_TICKS(100, APP_TIMER_PRESCALER),
                                 bsp_event_handler);
    APP_ERROR_CHECK(err_code);
 
    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);
 
    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}
*/

/**@brief Function for initializing the Connection Parameters module.
 * one time boot init
 */
static void conn_params_init(void)
{
    uint32_t err_code;
    ble_conn_params_init_t cp_init;
 
    memset(&cp_init, 0, sizeof(cp_init));
 
    cp_init.p_conn_params                  = NULL;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail             = false;
    cp_init.evt_handler                    = on_conn_params_evt;
    cp_init.error_handler                  = conn_params_error_handler;
 
    err_code = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);

}

static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;
        
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);
 
    memset(&gap_conn_params, 0, sizeof(gap_conn_params));
 
    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;
 
    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}
 /** @brief Function for initializing the Database Discovery Module.
 * One time init at boot
 */
static void db_discovery_init(void)
{
    uint32_t err_code = ble_db_discovery_init(db_discovery_handler);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing services that will be used by the application.
 * One time boot init
 */
static void services_init(void)
{
    comm_ble_init();
}
 
/**@brief Function for initializing the BLE stack.
 * One time init at boot
 * @details Initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
    uint32_t err_code;

    nrf_clock_lf_cfg_t clock_lf_cfg = NRF_CLOCK_LFCLKSRC;

    // Initialize the SoftDevice handler module.
    SOFTDEVICE_HANDLER_INIT(&clock_lf_cfg, NULL);

    ble_enable_params_t ble_enable_params;
    err_code = softdevice_enable_get_default_config(CENTRAL_LINK_COUNT,
                                                    PERIPHERAL_LINK_COUNT,
                                                    &ble_enable_params);
    APP_ERROR_CHECK(err_code);
    // We have almost no GATTs
//    ble_enable_params.gatts_enable_params.attr_tab_size = BLE_GATTS_ATTR_TAB_SIZE_MIN;
//    ble_enable_params.common_enable_params.vs_uuid_count = 1;
    //Check the ram settings against the used number of links
    CHECK_RAM_START_ADDR(CENTRAL_LINK_COUNT,
                                PERIPHERAL_LINK_COUNT);

    // Enable BLE stack.
#if (NRF_SD_BLE_API_VERSION == 3)
    ble_enable_params.gatt_enable_params.att_mtu = NRF_BLE_MAX_MTU_SIZE;
#endif
    err_code = softdevice_enable(&ble_enable_params);
    APP_ERROR_CHECK(err_code);

    // Register with the SoftDevice handler module for BLE events.
    err_code = softdevice_ble_evt_handler_set(ble_evt_dispatch);
    APP_ERROR_CHECK(err_code);


}

/* One time boot init of ble stack */
static void ble_init(void) {
    db_discovery_init();

    ble_stack_init();

    gap_params_init();
    services_init();

    // Initialise connection parameters
    conn_params_init();
}

/* one time system init */
static void system_init(void)
{            
    softdevice_sys_evt_handler_set(sys_evt_handler);
        
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, NULL);
}

// Return the 'measured power @ 1m' field value for the ibeacon
static uint8_t makeAdvPowerLevel( void )
{
    // If explciitly set (eg via AT cmd) use value 
    if (cfg_getExtra_Value()!=0) {
        return cfg_getExtra_Value();
    }
    // Otherwise we use value based on tx power and battery
    uint8_t result_adv = 0;
    float battery = 0.0;
    
    // Get voltage
    hal_bsp_adc_init();
    battery = (float)hal_bsp_adc_read_u16();
    hal_bsp_adc_disable();
    battery = (battery * 3.6) / 1024.0;
 
