brianwyld/ble_nrf52_v2/src/main.c
    if(battery > 3.2)
    {
        result_adv = 0x18;
    }
    else if((battery <= 3.2) && (battery > 3.0))
    {
        result_adv = 0x10;
    }
    else if((battery <= 3.0) && (battery > 2.9))
    {
        result_adv = 0x08;
    }
    else if(battery <= 2.9)
    {
        result_adv = 0x00;
    }
    else
    {
        result_adv = 0x00;
    }
    
    // add tx power to the byte
    switch(cfg_getTXPOWER_Level())
    {
        case (int8_t)0x00: // RADIO_TXPOWER_TXPOWER_0dBm
            result_adv |= 0x00;
        break;
        
        case (int8_t)0xFC: // RADIO_TXPOWER_TXPOWER_Neg4dBm:
            result_adv |= 0x01;
        break;
        
        case (int8_t)0xF8: // RADIO_TXPOWER_TXPOWER_Neg8dBm:
            result_adv |= 0x02;
        break;
        
        case (int8_t)0xF4: // RADIO_TXPOWER_TXPOWER_Neg12dBm:
            result_adv |= 0x03;
        break;
        
        case (int8_t)0xF0: // RADIO_TXPOWER_TXPOWER_Neg16dBm:
            result_adv |= 0x04;
        break;
        
        case (int8_t)0xEC: // RADIO_TXPOWER_TXPOWER_Neg20dBm:
            result_adv |= 0x05;
        break;
        
        case (int8_t)0xD8: // RADIO_TXPOWER_TXPOWER_Neg30dBm:
            result_adv |= 0x06;
        break;
        
        case (int8_t)0x04UL: //RADIO_TXPOWER_TXPOWER_Pos4dBm:
            result_adv |= 0x07;
        break;
        
        default:
            result_adv |= 0x05;
        break;
    }
 
    return result_adv;
}
 
/**@brief Function for initializing the Advertising functionality params
 * call before each start of beaconning to update from config in case it changed
 */
static void advertising_setup(void)
{
    uint32_t               err_code;
    ble_advdata_t          advdata;
    ble_advdata_t          scanrsp;
    ble_adv_modes_config_t options;
    ble_advdata_manuf_data_t manuf_specific_data; 
    ble_uuid_t m_adv_uuids[] = {{BLE_UUID_NUS_SERVICE, NUS_SERVICE_UUID_TYPE}};     // Advertise NUS server for at commands over NUS
    int8_t txPowerLevel = cfg_getTXPOWER_Level();

    uint8_t flags = (BLE_GAP_ADV_FLAG_LE_GENERAL_DISC_MODE |
                                        BLE_GAP_ADV_FLAG_BR_EDR_NOT_SUPPORTED);
    memset(&advdata, 0, sizeof(advdata));
    memset(&scanrsp, 0, sizeof(scanrsp));
    memset(&options, 0, sizeof(options));

    manuf_specific_data.company_identifier = cfg_getCompanyID();

    _ctx.m_beacon_info[0] = _ctx.device_type;
    _ctx.m_beacon_info[1] = _ctx.adv_data_length;
    memcpy(&_ctx.m_beacon_info[2], cfg_getUUID(), UUID128_SIZE);

    _ctx.m_beacon_info[18] = MSB_16(cfg_getMajor_Value());
    _ctx.m_beacon_info[19] = LSB_16(cfg_getMajor_Value());
    _ctx.m_beacon_info[20] = MSB_16(cfg_getMinor_Value());
    _ctx.m_beacon_info[21] = LSB_16(cfg_getMinor_Value());
    
    _ctx.m_beacon_info[22] = makeAdvPowerLevel();

    manuf_specific_data.data.p_data = (uint8_t *) (&_ctx.m_beacon_info[0]);
    manuf_specific_data.data.size   = APP_BEACON_INFO_LENGTH;
 
    // Build advertising data struct to pass into @ref ble_advertising_init.
/*
    if (ble_device_type == UART_MODULE)
    {
        advdata.name_type          = BLE_ADVDATA_FULL_NAME;
        advdata.include_appearance = false;
        advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;
    }
    */
    advdata.name_type             = BLE_ADVDATA_NO_NAME;
    advdata.flags                 = flags;
    advdata.p_manuf_specific_data = &manuf_specific_data;

    err_code = ble_advdata_set(&advdata, NULL);
    APP_ERROR_CHECK(err_code);
    
    // Initialize advertising parameters (used when starting advertising).
    memset(&_ctx.m_adv_params, 0, sizeof(_ctx.m_adv_params));
    _ctx.m_adv_params.type        = BLE_GAP_ADV_TYPE_ADV_IND;
    _ctx.m_adv_params.p_peer_addr = NULL;                             // Undirected advertisement.
    _ctx.m_adv_params.fp          = BLE_GAP_ADV_FP_ANY;
    _ctx.m_adv_params.interval    = MSEC_TO_UNITS(cfg_getADV_IND(), UNIT_0_625_MS); //NON_CONNECTABLE_ADV_INTERVAL;
    _ctx.m_adv_params.timeout     = APP_CFG_NON_CONN_ADV_TIMEOUT;
 
    scanrsp.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    scanrsp.uuids_complete.p_uuids  = m_adv_uuids;
    scanrsp.name_type = BLE_ADVDATA_FULL_NAME;
    scanrsp.p_tx_power_level = &txPowerLevel;

    options.ble_adv_fast_enabled  = true;
    options.ble_adv_fast_interval = MSEC_TO_UNITS(cfg_getADV_IND(), UNIT_0_625_MS);
    options.ble_adv_fast_timeout  = APP_ADV_TIMEOUT_IN_SECONDS;
    options.ble_adv_slow_enabled = true;
    options.ble_adv_slow_interval = MSEC_TO_UNITS(APP_ADV_INTERVAL_MS_SLOW, UNIT_0_625_MS);     //1285*1.6;
    options.ble_adv_slow_timeout  = APP_ADV_TIMEOUT_IN_SECONDS;
 
    err_code = ble_advertising_init(&advdata, &scanrsp, &options, on_adv_evt, NULL);
    APP_ERROR_CHECK(err_code);
}
 
 

static bool advertising_check_start()
{
    uint32_t err_code;
    // Can't start if currently got an active BLE connection (not enough channels)
    if (_ctx.m_conn_handle!=BLE_CONN_HANDLE_INVALID) {
        return false;
    }
    // in all cases, setup to be ready otherwise the ble_advertisting_start() will fail with wrong state error
    ble_gap_conn_sec_mode_t sec_mode;    
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    // password check has not been validated
    cfg_resetPasswordOk();
    // Change name
    sd_ble_gap_device_name_set(&sec_mode,
                            (const uint8_t *)(cfg_getAdvName()),
                                strlen(cfg_getAdvName()));

    // Change tx power level
    sd_ble_gap_tx_power_set(cfg_getTXPOWER_Level());

    advertising_setup();
    // only advertise if we want to be connectable, or we are ibeaconning, and we are NOT scanning
    if ((cfg_getConnectable() || ibb_isBeaconning())) // && ibs_is_scan_active()==false)
    {
        err_code = ble_advertising_start(ibb_isBeaconning()?BLE_ADV_MODE_FAST:BLE_ADV_EVT_SLOW);
        APP_ERROR_CHECK(err_code);
        log_info("adv check : connectable [%s] beaconning : %s", cfg_getAdvName(), ibb_isBeaconning()?"yes":"no");
        return true;
    } else {
        //idle the adverts
        err_code = ble_advertising_start(BLE_ADV_MODE_IDLE);
        APP_ERROR_CHECK(err_code);
        sd_ble_gap_adv_stop();
        log_info("adv check: no beaconning");
        return false;
    }
}
 


/** @brief Function for the Power manager.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}


 
