brianwyld/ble_nrf52_v2/src/main.c
/*
static void deinit_uart_timeout_handler(void * p_context)
{
    comm_uart_deinit();
    
    //
    //examples to setup TX/RX in different mode :
    //
    //nrf_gpio_cfg_default(RX_PIN_NUMBER);
    //nrf_gpio_cfg_default(TX_PIN_NUMBER);
    //
    //nrf_gpio_cfg_output(RX_PIN_NUMBER);
    //nrf_gpio_pin_set(RX_PIN_NUMBER);
    //nrf_gpio_cfg_output(TX_PIN_NUMBER);
    //nrf_gpio_pin_set(TX_PIN_NUMBER);
    //
    //nrf_gpio_cfg_input(RX_PIN_NUMBER, GPIO_PIN_CNF_PULL_Pulldown);
    //nrf_gpio_cfg_input(TX_PIN_NUMBER, GPIO_PIN_CNF_PULL_Pulldown);
}
*/


// Control of beaconning activity
bool ibb_isBeaconning() {
    return (cfg_isIBeaconning());
}

void ibb_start() {
    cfg_setIsIBeaconning(true);
    advertising_check_start();
}
void ibb_stop() {
    cfg_setIsIBeaconning(false);
    advertising_check_start();
}

/** request a reset asap */
void app_reset_request() {
    _ctx.resetRequested = true;    
}

void app_setFlashBusy() {
    _ctx.flashBusy = true;      // someone somewhere is writing to the flash
}
bool app_isFlashBusy() {
    return _ctx.flashBusy;      // they would like to know if its busy right now
}

int main(void)
{
    system_init();
    // Init uart asap in case using for logs also
    comm_uart_init(); // REV B invert TX RX for board//

#ifdef RELEASE_BUILD
    wlog_init(-1);      // replace by 0 to get logs on uart
#else 
    wlog_init(-1);      // replace by 0 to get logs on uart
#endif
    cfg_init();              
   log_info("config/log init done");
    
    ble_init();
   log_info("ble system init done");
    // Tell host we are ready to rock
    comm_uart_tx((uint8_t *)"READY\r\n",7, NULL);
    // Init adv parameters and start if required
    advertising_check_start();

    //todo remove uart disabled at 10s of ibeaconning for power
    /*                    
    app_timer_create(&m_deinit_uart_delay,
                        APP_TIMER_MODE_SINGLE_SHOT,
                        deinit_uart_timeout_handler);    
        uint32_t deinit_delay = APP_TIMER_TICKS(10000, APP_TIMER_PRESCALER);//32 * 10000;          
        app_timer_start(m_deinit_uart_delay, deinit_delay, NULL);
    */

   log_info("waiting for commands");
    for (;;)
    {        
        if (_ctx.resetRequested)
        {
            NVIC_SystemReset();
        }
        cfg_writeCheck();
        
        // Go in lowpower only if flash isn't busy
        if(!app_isFlashBusy())
        {
            power_manage();
        }
    }
}

#ifdef UART_DBG
static void uart_event_handler(app_uart_evt_t * p_event)
{    
    switch (p_event->evt_type)
    {
        case APP_UART_DATA_READY:
        {
            // Read all the bytes we can 
            uint8_t c;
            while(app_uart_get(&c)==NRF_SUCCESS) 
            {
                app_uart_put(&c);
            }
            break;
        }
        default:
            break;
    }
}

// UARTs config
static app_uart_comm_params_t _uart_comm_params =
    {
        .rx_pin_no = 3, // RX_PIN_NUMBER A
        .tx_pin_no = 4, // TX_PIN_NUMBER A
        .rts_pin_no = -1,
        .cts_pin_no = -1,
        .flow_control = APP_UART_FLOW_CONTROL_DISABLED,
        .use_parity = false,
        .baud_rate = UART_BAUDRATE_BAUDRATE_Baud115200,
    };
int uart_tx(char* line) {
    int len = strlen(line);
    for(int i=0;i<len;i++) {
        // nrf uart api only allows one uart, sorry
        if (app_uart_put((uint8_t)(line[i]))!=NRF_SUCCESS) {
            return (len-i);       // Number of bytes not txd
        }
    }
}
int main(void)
{
    system_init();

    uint32_t  err_code=0;
    APP_UART_FIFO_INIT( (&_uart_comm_params),
                       UART_RX_BUF_SIZE,
                       UART_TX_BUF_SIZE,
                       uart_event_handler,
                       APP_IRQ_PRIORITY_LOW,
                       err_code);
    APP_ERROR_CHECK(err_code);

    // Tell host we are ready to rock
    uart_tx("READY\r\n");
    for (;;)
    {        
//        power_manage();
        uart_tx("*");
    }
}
#endif